public_html/Embedded System/kernel/Memory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Memory</title>
<!-- 2014-10-27 Mon 22:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Memory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Kernel memory handling</a>
<ul>
<li><a href="#sec-1-1">Kernel memory allocation</a></li>
<li><a href="#sec-1-2">Turning off overcommit</a></li>
<li><a href="#sec-1-3">Stack overflow</a></li>
</ul>
</li>
<li><a href="#sec-2">The Linux Page Cache and pdflush:</a>
<ul>
<li><a href="#sec-2-1">writes data out</a></li>
<li><a href="#sec-2-2">pdflush tunables</a></li>
</ul>
</li>
<li><a href="#sec-3">Reference</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Kernel memory handling<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Kernel memory allocation</h3>
<div class="outline-text-3" id="text-1-1">
</div><ul class="org-ul"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Buddy system<br  /><div class="outline-text-4" id="text-1-1-1">
<p>
The kernel uses a buddy system with power-of-two sizes. For order 0,
1, 2, &#x2026;, 9 it has lists of areas containing 2<sup>order</sup> pages. If a
small area is needed and only a larger area is available, the larger
area is split into two halves (buddies), possibly repeatedly.
</p>
</div>
</li>
<li><a id="sec-1-1-2" name="sec-1-1-2"></a>get<sub>free</sub><sub>page</sub><br  /><div class="outline-text-4" id="text-1-1-2">
<p>
The routine <code>__get_free_page()</code> will give us a page. The routine
<code>__get_free_pages()</code> will give a number of consecutive pages. (A power
of two, from 1 to 512 or so. The above buddy system is used.)
</p>
</div>
</li>
<li><a id="sec-1-1-3" name="sec-1-1-3"></a>kmalloc<br  /><div class="outline-text-4" id="text-1-1-3">
<p>
The routine kmalloc() is good for an area of unknown, arbitrary,
smallish length, in the range 32-131072 (more precisely: 1/128 of a
page up to 32 pages), preferably below 4096. For the sizes, see
<code>&lt;linux/kmalloc_sizes.h&gt;</code>. Because of fragmentation, it will be
difficult to get large consecutive areas from kmalloc(). These days
kmalloc() returns memory from one of a series of slab caches (see
below) with names like "size-32", &#x2026;, "size-131072".
</p>
</div>
</li>

<li><a id="sec-1-1-4" name="sec-1-1-4"></a>Priority<br  /><div class="outline-text-4" id="text-1-1-4">
<p>
there is a bit specifying whether we would like a hot or a cold page
(that is, a page likely to be in the CPU cache, or a page not likely
to be there). If the page will be used by the CPU, a hot page will be
faster. If the page will be used for device DMA the CPU cache would be
invalidated anyway, and a cold page does not waste precious cache
contents.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff7f24;">//</span><span style="color: #ff7f24;">linux/gfp.h</span>
<span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Zone modifiers in GFP_ZONEMASK (see linux/mmzone.h - low four bits) </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_DMA</span>       0x01

<span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Action modifiers - doesn't change the zoning </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_WAIT</span>      0x10    <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Can wait and reschedule? </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_HIGH</span>      0x20    <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Should access emergency pools? </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_IO</span>        0x40    <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Can start low memory physical IO? </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_FS</span>        0x100   <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Can call down to low-level FS? </span><span style="color: #ff7f24;">*/</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">__GFP_COLD</span>      0x200   <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">Cache-cold page required </span><span style="color: #ff7f24;">*/</span>

<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">GFP_NOIO</span>        (__GFP_WAIT)
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">GFP_NOFS</span>        (__GFP_WAIT | __GFP_IO )
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">GFP_ATOMIC</span>      (__GFP_HIGH)
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">GFP_USER</span>        (__GFP_WAIT | __GFP_IO | __GFP_FS)
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">GFP_KERNEL</span>      (__GFP_WAIT | __GFP_IO | __GFP_FS)
</pre>
</div>

<p>
Uses:
</p>

<ul class="org-ul">
<li><code>GFP_KERNEL</code> is the default flag. Sleeping is allowed.
</li>
<li><code>GFP_ATOMIC</code> is used in interrupt handlers. Never sleeps.
</li>
<li><code>GFP_USER</code> for user mode allocations. Low priority, and may sleep. (Today equal to GFP<sub>KERNEL</sub>.)
</li>
<li><code>GFP_NOIO</code> must not call down to drivers (since it is used from drivers).
</li>
<li><code>GFP_NOFS</code> must not call down to filesystems (since it is used from
filesystems &#x2013; see, e.g., dcache.c: <code>shrink_dcache_memory</code> and
inode.c: <code>shrink_icache_memory</code>).
</li>
</ul>
</div>
</li>
<li><a id="sec-1-1-5" name="sec-1-1-5"></a>vmalloc<br  /><div class="outline-text-4" id="text-1-1-5">
<p>
The routine vmalloc() has a similar purpose, but has a better chance
of being able to return larger consecutive areas, and is more
expensive. It uses page table manipulation to create an area of memory
that is consecutive in virtual memory, but not necessarily in physical
memory. Device I/O to such an area is a bad idea. It uses the above
calls with <code>GFP_KERNEL</code> to get its memory, so cannot be used in
interrupt context.
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Turning off overcommit</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Since 2.5.30 the values are: 0 (default): as before: guess about how
much overcommitment is reasonable, 1: never refuse any malloc(), 2: be
precise about the overcommit - never commit a virtual address space
larger than swap space plus a fraction overcommit<sub>ratio</sub> of the
physical memory. Here /proc/sys/vm/overcommit<sub>ratio</sub> (by default 50) is
another user-settable parameter. It is possible to set
overcommit<sub>ratio</sub> to values larger than 100. 
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Stack overflow</h3>
<div class="outline-text-3" id="text-1-3">
<p>
A simple demo that catches SIGSEGV:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;stdlib.h&gt;</span>
<span style="color: #b0c4de;">#include</span> <span style="color: #ffa07a;">&lt;signal.h&gt;</span>

<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">segfault</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">dummy</span>) {
        printf(<span style="color: #ffa07a;">"Help!\n"</span>);
        exit(1);
}

<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>() {
        <span style="color: #98fb98;">int</span> *<span style="color: #eedd82;">p</span> = 0;

        signal(SIGSEGV, segfault);
        *p = 17;
        <span style="color: #00ffff;">return</span> 0;
}
</pre>
</div>
<p>
Without the exit() here, this demo will loop because the illegal assignment is restarted.
This simple demo fails to catch stack overflow, because there is no stack space for a call frame for the segfault() interrupt handler. If it is desired to catch stack overflow one first must set up an alternative stack. As follows:
</p>

<div class="org-src-container">

<pre class="src src-c">...
<span style="color: #98fb98;">int</span> main() {
        <span style="color: #98fb98;">char</span> <span style="color: #eedd82;">myaltstack</span>[SIGSTKSZ];
        <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">sigaction</span> <span style="color: #eedd82;">act</span>;
        <span style="color: #98fb98;">stack_t</span> <span style="color: #eedd82;">ss</span>;

        ss.ss_sp = myaltstack;
        ss.ss_size = <span style="color: #00ffff;">sizeof</span>(myaltstack);
        ss.ss_flags = 0;
        <span style="color: #00ffff;">if</span> (sigaltstack(&amp;ss, <span style="color: #7fffd4;">NULL</span>))
                errexit(<span style="color: #ffa07a;">"sigaltstack failed"</span>);

        act.sa_handler = segfault;
        act.sa_flags = SA_ONSTACK;
        <span style="color: #00ffff;">if</span> (sigaction(SIGSEGV, &amp;act, <span style="color: #7fffd4;">NULL</span>))
                errexit(<span style="color: #ffa07a;">"sigaction failed"</span>);
...
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The Linux Page Cache and pdflush:<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup></h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">writes data out</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Linux usually writes data out of the page cache using a process called
pdflush. At any moment, between 2 and 8 pdflush threads are running on
the system. You can monitor how many are active by looking at
<code>/proc/sys/vm/nr_pdflush_threads</code>. Whenever all existing pdflush threads
are busy for at least one second, an additional pdflush daemon is
spawned. The new ones try to write back data to device queues that are
not congested, aiming to have each device that's active get its own
thread flushing data to that device. Each time a second has passed
without any pdflush activity, one of the threads is removed. There are
tunables for adjusting the minimum and maximum number of pdflush
processes, but it's very rare they need to be adjusted.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">pdflush tunables</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Exactly what each pdflush thread does is controlled by a series of
parameters in /proc/sys/vm:
</p>
</div>

<ul class="org-ul"><li><a id="sec-2-2-1" name="sec-2-2-1"></a><code>/proc/sys/vm/dirty_writeback_centisecs</code><br  /><div class="outline-text-4" id="text-2-2-1">
<p>
(default 500): In hundredths of a second, this is how often pdflush
wakes up to write data to disk. The default wakes up the two (or more)
active threads every five seconds.
</p>

<p>
Because of all this, it's unlikely you'll gain much benefit from
lowering the writeback time; the thread spawning code assures that
they will automatically run themselves as often as is practical to try
and meet the other requirements.
</p>
</div>
</li>

<li><a id="sec-2-2-2" name="sec-2-2-2"></a><code>/proc/sys/vm/dirty_expire_centiseconds</code><br  /><div class="outline-text-4" id="text-2-2-2">
<p>
The first thing pdflush works on is writing pages that have been dirty
for longer than it deems acceptable.
</p>

<p>
(default 3000): In hundredths of a second, how long data can be in the
page cache before it's considered expired and must be written at the
next opportunity. Note that this default is very long: a full 30
seconds. That means that under normal circumstances, unless you write
enough to trigger the other pdflush method, Linux won't actually
commit anything you write until 30 seconds later.
</p>
</div>
</li>
<li><a id="sec-2-2-3" name="sec-2-2-3"></a><code>/proc/sys/vm/dirty_background_ratio</code><br  /><div class="outline-text-4" id="text-2-2-3">
<p>
(default 10): Maximum percentage of active that can be filled with
dirty pages before pdflush begins to write them
</p>

<p>
Note that some kernel versions may internally put a lower bound on
this value at 5%.
</p>

<p>
Most of the documentation you'll find about this parameter suggests
it's in terms of total memory, but a look at the source code shows
this isn't true. In terms of the meminfo output, the code actually
looks at <code>MemFree + Cached - Mapped</code>-
</p>
</div>
</li>
<li><a id="sec-2-2-4" name="sec-2-2-4"></a>Summary: when does pdflush write?<br  /><div class="outline-text-4" id="text-2-2-4">
<p>
In the default configuration, then, data written to disk will sit in
memory until either a) they're more than 30 seconds old, or b) the
dirty pages have consumed more than 10% of the active, working memory.
If you are writing heavily, once you reach the dirty<sub>background</sub><sub>ratio</sub>
driven figure worth of dirty memory, you may find that all your writes
are driven by that limit.
</p>
</div>
</li>
<li><a id="sec-2-2-5" name="sec-2-2-5"></a><code>/proc/sys/vm/dirty_ratio</code><br  /><div class="outline-text-4" id="text-2-2-5">
<p>
/proc/sys/vm/dirty<sub>ratio</sub> (default 40): Maximum percentage of total
memory that can be filled with dirty pages before processes are forced
to write dirty buffers themselves during their time slice instead of
being allowed to do more writes.
</p>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Reference</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Understanding the Linux Virtual Memory Manager By Mel Gorman
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
<a href="http://www.win.tue.nl/~aeb/linux/lk/lk-9.html">http://www.win.tue.nl/~aeb/linux/lk/lk-9.html</a>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://www.westnet.com/~gsmith/content/linux-pdflush.htm">http://www.westnet.com/~gsmith/content/linux-pdflush.htm</a>
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-10-27 Mon 22:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
